Revit 2027 API
MechanicalSystem.DuctNetwork Property
 The ducts and fittings contained within the system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementSet DuctNetwork { get; }
Public ReadOnly Property DuctNetwork As ElementSet
	Get
public:
property ElementSet^ DuctNetwork {
	ElementSet^ get ();
}
member DuctNetwork : ElementSet with get
Property Value
ElementSet
Remarks
 The return value doesn't include terminals or equipments, the ducts and fittings are returned in no particular order.
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace